In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [4]:
Name=['Alen','Aswin','Abhi','Arun','Kiran']
Place=['PTM','TVM','TVM','PKD','KLM']

# Create list and make to dataframe with column name

In [7]:
data=pd.DataFrame(list(zip(Name,Place)),columns=['Name','Place'])
data

    Name Place
0   Alen   PTM
1  Aswin   TVM
2   Abhi   TVM
3   Arun   PKD
4  Kiran   KLM

# Create list and make to dataframe without column name

In [8]:
data=pd.DataFrame(list(zip(Name,Place)))
data

       0    1
0   Alen  PTM
1  Aswin  TVM
2   Abhi  TVM
3   Arun  PKD
4  Kiran  KLM

In [10]:
list_of_dict=[{'Name':"Varun",'Age':23,'DOB': "20/02/97", 'Gender':"M"},
     {'Name':"Arun",'Age':29,'DOB': "01/07/91", 'Gender':"M"},
      {'Name':"Sita",'Age':14,'DOB': "07/07/06", 'Gender':"F"},
    {'Name':"Rita",'Age':21,'DOB': "01/05/99", 'Gender':"F"},
    {'Name':"Ram",'Age':32,'DOB': "07/11/88", 'Gender':"M"},
     {'Name':"Radha",'Age':23,'DOB': "06/09/97", 'Gender':"F"},
    {'Name':"Mohan",'Age':51,'DOB': "03/03/69", 'Gender':"M"}         
         
]

In [12]:
data1=pd.DataFrame(list_of_dict)
data1

    Name  Age       DOB Gender
0  Varun   23  20/02/97      M
1   Arun   29  01/07/91      M
2   Sita   14  07/07/06      F
3   Rita   21  01/05/99      F
4    Ram   32  07/11/88      M
5  Radha   23  06/09/97      F
6  Mohan   51  03/03/69      M